TexasInstruments/mspm0-sdk/source/ti/devices/msp/m0p/mspm0h321x.h
/* IOMUX_PINCM13[PF] Bits */
#define IOMUX_PINCM13_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM13_PF_GPIOA_DIO08                  ((uint32_t)0X00000001)
#define IOMUX_PINCM13_PF_UART1_TX                     ((uint32_t)0X00000002)
#define IOMUX_PINCM13_PF_SPI0_CS0                     ((uint32_t)0X00000003)
#define IOMUX_PINCM13_PF_I2C0_SDA                     ((uint32_t)0X00000004)
#define IOMUX_PINCM13_PF_TIMA0_CCP0                   ((uint32_t)0X00000005)
#define IOMUX_PINCM13_PF_TIMA_FAULT2                  ((uint32_t)0X00000006)
#define IOMUX_PINCM13_PF_TIMA_FAULT0                  ((uint32_t)0X00000007)
#define IOMUX_PINCM13_PF_SPI0_CS3_CD_POCI3            ((uint32_t)0X00000008)
#define IOMUX_PINCM13_PF_TIMG2_CCP1                   ((uint32_t)0X00000009)
#define IOMUX_PINCM13_PF_SYSCTL_HFCLKIN               ((uint32_t)0X0000000A)
#define IOMUX_PINCM13_PF_UART0_RTS                    ((uint32_t)0X0000000B)
#define IOMUX_PINCM13_PF_SPI0_SCLK                    ((uint32_t)0X0000000C)
#define IOMUX_PINCM13_PF_UART1_RX                     ((uint32_t)0X0000000D)
#define IOMUX_PINCM13_PF_TIMA0_CCP3_CMPL              ((uint32_t)0X0000000E)

/* IOMUX_PINCM14[PF] Bits */
#define IOMUX_PINCM14_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM14_PF_GPIOA_DIO09                  ((uint32_t)0X00000001)
#define IOMUX_PINCM14_PF_UART1_RX                     ((uint32_t)0X00000002)
#define IOMUX_PINCM14_PF_SPI0_PICO                    ((uint32_t)0X00000003)
#define IOMUX_PINCM14_PF_I2C0_SCL                     ((uint32_t)0X00000004)
#define IOMUX_PINCM14_PF_TIMA0_CCP0_CMPL              ((uint32_t)0X00000005)
#define IOMUX_PINCM14_PF_SYSCTL_CLK_OUT               ((uint32_t)0X00000006)
#define IOMUX_PINCM14_PF_TIMA0_CCP1                   ((uint32_t)0X00000007)
#define IOMUX_PINCM14_PF_LFSS_RTC_OUT                 ((uint32_t)0X00000008)
#define IOMUX_PINCM14_PF_TIMG2_CCP0                   ((uint32_t)0X00000009)
#define IOMUX_PINCM14_PF_SPI0_POCI                    ((uint32_t)0X0000000A)
#define IOMUX_PINCM14_PF_UART0_CTS                    ((uint32_t)0X0000000B)
#define IOMUX_PINCM14_PF_TIMA_FAULT1                  ((uint32_t)0X0000000C)
#define IOMUX_PINCM14_PF_TIMG1_CCP1                   ((uint32_t)0X0000000D)

/* IOMUX_PINCM15[PF] Bits */
#define IOMUX_PINCM15_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM15_PF_GPIOA_DIO10                  ((uint32_t)0X00000001)
#define IOMUX_PINCM15_PF_UART0_TX                     ((uint32_t)0X00000002)
#define IOMUX_PINCM15_PF_SPI0_POCI                    ((uint32_t)0X00000003)
#define IOMUX_PINCM15_PF_I2C0_SDA                     ((uint32_t)0X00000004)
#define IOMUX_PINCM15_PF_TIMA0_CCP2                   ((uint32_t)0X00000005)
#define IOMUX_PINCM15_PF_SYSCTL_CLK_OUT               ((uint32_t)0X00000006)
#define IOMUX_PINCM15_PF_TIMG14_CCP0                  ((uint32_t)0X00000007)
#define IOMUX_PINCM15_PF_I2C1_SDA                     ((uint32_t)0X00000008)
#define IOMUX_PINCM15_PF_TIMA_FAULT1                  ((uint32_t)0X0000000A)
#define IOMUX_PINCM15_PF_TIMA0_CCP1_CMPL              ((uint32_t)0X0000000C)
#define IOMUX_PINCM15_PF_TIMG8_CCP1                   ((uint32_t)0X0000000D)
#define IOMUX_PINCM15_PF_SPI0_PICO                    ((uint32_t)0X0000000E)

/* IOMUX_PINCM16[PF] Bits */
#define IOMUX_PINCM16_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM16_PF_GPIOA_DIO11                  ((uint32_t)0X00000001)
#define IOMUX_PINCM16_PF_UART0_RX                     ((uint32_t)0X00000002)
#define IOMUX_PINCM16_PF_SPI0_SCLK                    ((uint32_t)0X00000003)
#define IOMUX_PINCM16_PF_I2C0_SCL                     ((uint32_t)0X00000004)
#define IOMUX_PINCM16_PF_TIMA0_CCP2_CMPL              ((uint32_t)0X00000005)
#define IOMUX_PINCM16_PF_UART1_RX                     ((uint32_t)0X00000006)
#define IOMUX_PINCM16_PF_TIMG14_CCP1                  ((uint32_t)0X00000007)
#define IOMUX_PINCM16_PF_I2C1_SCL                     ((uint32_t)0X00000008)
#define IOMUX_PINCM16_PF_TIMA_FAULT0                  ((uint32_t)0X0000000A)
#define IOMUX_PINCM16_PF_SPI0_CS0                     ((uint32_t)0X0000000C)

/* IOMUX_PINCM17[PF] Bits */
#define IOMUX_PINCM17_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM17_PF_GPIOB_DIO06                  ((uint32_t)0X00000001)
#define IOMUX_PINCM17_PF_UART1_TX                     ((uint32_t)0X00000002)
#define IOMUX_PINCM17_PF_TIMG8_CCP0                   ((uint32_t)0X00000005)
#define IOMUX_PINCM17_PF_UART2_CTS                    ((uint32_t)0X00000006)
#define IOMUX_PINCM17_PF_TIMG1_CCP0                   ((uint32_t)0X00000007)
#define IOMUX_PINCM17_PF_TIMA_FAULT2                  ((uint32_t)0X00000008)
#define IOMUX_PINCM17_PF_SPI0_CS1_POCI1               ((uint32_t)0X00000009)
#define IOMUX_PINCM17_PF_TIMA0_CCP3_CMPL              ((uint32_t)0X0000000B)
#define IOMUX_PINCM17_PF_TIMG8_CCP1                   ((uint32_t)0X0000000C)
#define IOMUX_PINCM17_PF_TIMA0_CCP2_CMPL              ((uint32_t)0X0000000D)
#define IOMUX_PINCM17_PF_UART0_TX                     ((uint32_t)0X0000000E)

/* IOMUX_PINCM18[PF] Bits */
#define IOMUX_PINCM18_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM18_PF_GPIOB_DIO07                  ((uint32_t)0X00000001)
#define IOMUX_PINCM18_PF_UART1_RX                     ((uint32_t)0X00000002)
#define IOMUX_PINCM18_PF_TIMG8_CCP1                   ((uint32_t)0X00000005)
#define IOMUX_PINCM18_PF_UART2_RTS                    ((uint32_t)0X00000006)
#define IOMUX_PINCM18_PF_TIMG1_CCP1                   ((uint32_t)0X00000007)
#define IOMUX_PINCM18_PF_SPI0_CS2_POCI2               ((uint32_t)0X00000009)
#define IOMUX_PINCM18_PF_SYSCTL_BEEPER                ((uint32_t)0X0000000C)
#define IOMUX_PINCM18_PF_SPI0_SCLK                    ((uint32_t)0X0000000D)
#define IOMUX_PINCM18_PF_UART0_RX                     ((uint32_t)0X0000000E)

/* IOMUX_PINCM19[PF] Bits */
#define IOMUX_PINCM19_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM19_PF_GPIOB_DIO08                  ((uint32_t)0X00000001)
#define IOMUX_PINCM19_PF_UART1_CTS                    ((uint32_t)0X00000002)
#define IOMUX_PINCM19_PF_TIMA0_CCP0                   ((uint32_t)0X00000005)
#define IOMUX_PINCM19_PF_TIMG1_CCP0                   ((uint32_t)0X00000007)
#define IOMUX_PINCM19_PF_SPI0_SCLK                    ((uint32_t)0X00000009)
#define IOMUX_PINCM19_PF_SYSCTL_BEEPER                ((uint32_t)0X0000000A)
#define IOMUX_PINCM19_PF_TIMG8_CCP0                   ((uint32_t)0X0000000B)
#define IOMUX_PINCM19_PF_UART0_RX                     ((uint32_t)0X0000000C)
#define IOMUX_PINCM19_PF_SPI0_POCI                    ((uint32_t)0X0000000D)
#define IOMUX_PINCM19_PF_I2C0_SCL                     ((uint32_t)0X0000000E)

/* IOMUX_PINCM20[PF] Bits */
#define IOMUX_PINCM20_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM20_PF_GPIOB_DIO09                  ((uint32_t)0X00000001)
#define IOMUX_PINCM20_PF_UART1_RTS                    ((uint32_t)0X00000002)
#define IOMUX_PINCM20_PF_TIMA0_CCP0_CMPL              ((uint32_t)0X00000005)
#define IOMUX_PINCM20_PF_TIMA0_CCP1                   ((uint32_t)0X00000006)
#define IOMUX_PINCM20_PF_TIMG1_CCP1                   ((uint32_t)0X00000007)
#define IOMUX_PINCM20_PF_TIMG2_CCP0                   ((uint32_t)0X00000008)
#define IOMUX_PINCM20_PF_SPI0_POCI                    ((uint32_t)0X0000000A)
#define IOMUX_PINCM20_PF_UART0_RX                     ((uint32_t)0X0000000B)
#define IOMUX_PINCM20_PF_I2C0_SCL                     ((uint32_t)0X0000000C)
#define IOMUX_PINCM20_PF_UART0_TX                     ((uint32_t)0X0000000D)
#define IOMUX_PINCM20_PF_I2C0_SDA                     ((uint32_t)0X0000000E)

